# AnalyticConstructionGbxmlTypeid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticConstructionGbxmlTypeid Property
ParameterTypeId Class See Also
---
"Construction Type Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticConstructionGbxmlTypeid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticConstructionGbxmlTypeid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticConstructionGbxmlTypeid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace